Revit 2024 API
SystemCalculationLevel Enumeration
 Enumerated type listing flags that can toggle on or off certain calculations related to MEP systems.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public enum SystemCalculationLevel
Visual Basic
Public Enumeration SystemCalculationLevel
Visual C++
public enum class SystemCalculationLevel
Members
Member name | Description
All |  System calculation is on for everything (with every bit being 1)
None |  System calculation is off
Flow |  System calculation is only for flow
Volume |  This mode is obsoleted in Revit 2017.
Performance |  This mode is reserved for limiting the system propagation and other performance-boosting options. Note that the system-related functionalities might be traded off for faster layout capability in large system when this mode is on. Be careful that this mode is NOT included in the "All" mode.
See Also
Autodesk.Revit.DB.Mechanical Namespace